Repository: 84000/data-translation-memory
Catalog: toh199_84000-the-sutra-on-maitreya-s-birth-in-the-heaven-of-joy.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གནམ་དུ་སྐྱེ་བ་བླངས་པའི་མདོ།
en: The Noble Mahāyāna Sūtra Maitreya’s Birth in the Heaven of Joy

source: །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་ཡུལ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ།
en: Thus did I hear at one time.

source: མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ། དེ་ནས་བཅོམ་ལྡན་འདས་མཚན་མོའི་ཐུན་དང་པོ་ལ། སྐུ་ལས་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་ནས། རྒྱལ་བྱེད་ཀྱི་ཚལ་ལན་བདུན་བསྐོར་ཏེ།
en: The Blessed One was staying in Prince Jeta’s Grove at Anāthapiṇḍada’s park in Śrāvastī, along with a great congregation of monks and many bodhisattva great beings. Then, during the first watch of the night, golden light rays emerged from the Blessed One’s body and circled the Jeta Grove seven times.

source: ཁྱིམ་བདག་སུ་ཏ་ཤ་ལ་སོགས་པ་འོད་ཀྱིས་རེག་པར་བྱས་ནས། འོད་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ནམ་མཁའ་ལ་སྤྲིན་བཞིན་དུ་ཁྱབ་པར་བྱས་ནས་མཉན་དུ་ཡོད་པའི་ཡུལ་ཀུན་ཏུ་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་མེ་ཏོག་ཆར་རབ་ཏུ་ཕབ་བོ། །འོད་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་ནང་ནས་སྤྲུལ་པའི་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་བརྒྱ་སྟོང་སྣང་བ་ཐམས་ཅད་ཀྱིས་གསུང་འཐུན་པར་བསྐལ་པ་འདི་ཉིད་དུ།
en: The light made contact with the householder Sudatta and others; then a golden light filled the sky like clouds, raining down golden flowers all over Śrāvastī. Amidst this golden light appeared an immeasurable number of hundreds of thousands of emanated thus-gone ones.

source: བྱང་ཆུབ་སེམས་དཔའ་སྟོང་གི་དང་པོ་ལོག་པར་དད་སེལ་སངས་རྒྱས་པ་ནས། ཐ་མར་སྣང་མཛད་སངས་རྒྱས་པའི་དོན་བཀའ་སྩལ་ཏོ།
en: They spoke in unison about the one thousand bodhisattvas to awaken in this eon, from the awakening firstly of Krakucchanda until the awakening finally of Roca.

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After they had spoken, the light of the thus-gone ones roused an entire retinue, which gathered around them like cloud banks.

source: ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་འཁོར་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་འཁོར་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་འཁོར་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འཁོར་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་། མ་ཧ་པ་ཤ་པ་ཏི་ལ་སོགས་པ་དགེ་སློང་མ་སྟོང་དང་། ཁྱིམ་བདག་སུ་ཏ་ཤ་ལ་སོགས་པ་དགེ་བསྙེན་ཕ་སུམ་སྟོང་དང་། བྱི་ཤྭ་ཁྲ་འཕོ་ཏ་ལ་སོགས་པ་དགེ་བསྙེན་མ་ཉིས་སྟོང་དང་། ཀུན་ཏུ་བཟང་པོ་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་བཅུ་དྲུག་དང་། ཆོས་ཀྱི་རྒྱལ་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སོགས་པ།
en: The retinue consisted of Venerable Ājñāta­kauṇḍinya, who arose from absorption, with a retinue of two hundred fifty monks; Venerable Mahākāśyapa, with a retinue of two hundred fifty monks; Venerable Maudgalyāyana, with a retinue of two hundred fifty monks; Venerable Śāriputra, with a retinue of two hundred fifty monks;

source: བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་ལ་སོགས་པ་འཁོར་ཐམས་ཅད། དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་བསྐུལ་ནས་སྤྲིན་བཞིན་དུ་འདུས་སོ།
en: one thousand fully ordained nuns including Mahāprajāpatī; three thousand laymen including the householder Sudatta; two thousand laywomen including Viśākhā; the sixteen bodhisattvas of the Fortunate Eon including Samantabhadra; and five hundred bodhisattvas including the Dharma prince Mañjuśrī; as well as gods, nāgas, yakṣas, and asuras.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ལྗགས་ཀྱི་དབང་པོ་ལས་འོད་ཟེར་སྟོང་ཕྱུང་ནས།
en: The Blessed One then produced a thousand light rays from his tongue.

source: འོད་ཟེར་རེ་རེ་ཁ་དོག་སྟོང་སྟོང་། ཁ་དོག་རེ་རེའི་ནང་ནས། སྤྲུལ་པའི་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་སྙེད་སྣང་ངོ་།
en: Each ray of light had a thousand colors, and within each color appeared an immeasurable number of emanated thus-gone ones.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་གསུང་འཐུན་པར། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པ་ཟབ་མོའི་གཟུངས་བསྟན་པ་འདི་ལྟ་སྟེ། ཨ་ནན་ཏ་མུ་དྲ་ཞེས་བྱ་བའི་གཟུངས་དང་། སྟོང་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཞེས་བྱ་བའི་གཟུངས་དང་། སྒྲིབ་པ་མེད་པའི་དངོས་པོ་ཞེས་བྱ་བའི་གཟུངས་དང་། མཚན་མ་མེད་པར་རྣམ་པར་གྲོལ་བ་ཆེན་པོ་ཞེས་བྱ་བའི་གཟུངས་ལ་སོགས་པ།
en: All these thus-gone ones then taught in unison the profound dhāraṇīs that show the purity of all phenomena, which all great bodhisattvas possess. They included the dhāraṇī called limitless gateway , the dhāraṇī called wisdom of emptiness , the dhāraṇī called unobscured nature , and the dhāraṇī called great liberation without marks

source: སྒྲ་སྐད་གཅིག་གིས་བརྒྱ་ཕྲག་བྱེ་བའི་གཟུངས་ཀྱི་སྒོ་བཀའ་སྩལ་ཏོ། །གཟུངས་ཀྱི་སྒོ་བཀའ་སྩལ་མ་ཐག་ཏུ། འཁོར་འདུས་པའི་ནང་ནས། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཞེས་བྱ་བ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཐོས་ནས། དེ་མ་ཐག་ཏུ་བྱེ་བ་བརྒྱ་ཕྲག་ཁྲིའི་གཟུངས་ཀྱི་སྒོ་ཐོབ་ནས།
en: With a single voice, they spoke billions of such dhāraṇī gateways. When they had spoken those dhāraṇī gateways, Maitreya, who was present in the retinue, attained ten trillion dhāraṇī gateways at the very instant that he heard what the Blessed One taught.

source: སྟན་ལས་ལངས་ཏེ་གོས་ཚགས་བཅོས་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ།
en: He rose from his seat, adjusted his robes, joined his palms together, and then settled himself before the Blessed One.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཨུ་པཱ་ལི་སྟན་ལས་ལངས་ཏེ། གདོང་དང་སྤྱི་བོས་ཕྱག་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་དུ་ཡང་མཛོད་ཀྱི་ཆོས་ཐམས་ཅད་ལས། མ་ཕམ་པ་མ་འོངས་པའི་དུས་སུ་སངས་རྒྱས་པར་གསུངས་ན།
en: Next, Venerable Upāli rose from his seat, bowed his head, and addressed the Blessed One, “Blessed One, long ago, in one of your treasured teachings the Blessed One spoke of Ajita’s future awakening.

source: མ་ཕམ་པ་སོ་སོའི་སྐྱེ་བོའི་ལུས་དང་མ་བྲལ། ཟག་པ་ཡང་མ་ཟད། མ་ཕམ་པ་འདི་ཉིད་དུ་རབ་ཏུ་བྱུང་ཡང་། ཏིང་ངེ་འཛིན་མི་བསྒོམ། ཉོན་མོངས་པ་མ་སྤངས་ན།
en: Ajita is not yet free from the body of an ordinary person, and his defilements have not yet been exhausted. He has gone forth in this life but has neither cultivated absorption nor abandoned the afflictions.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ངེས་པར་སངས་རྒྱས་པར་བཀའ་སྩལ་ན།
en: Yet, the Blessed One has said that he is certain to become awakened.

source: མ་ཕམ་པ་དེ་ཚེའི་དུས་བྱས་ནས། ཁམས་གང་དུ་སྐྱེ་བ་ལེན་པར་འགྱུར།
en: Therefore, when Ajita’s life is over, in which realm will he be reborn?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཨུ་པཱ་ལི་ལ་བཀའ་སྩལ་པ།
en: The Blessed One responded to Upāli, “Upāli, take heed and listen.

source: ཨུ་པཱ་ལི་གཅིག་ཏུ་གྱིས་ལ་ཉོན་ཅིག །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པས་འཁོར་འདིའི་ནང་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱས་པར་འགྱུར་བར་ལུང་བསྟན་གྱིས།
en: Since the Thus-Gone One is omniscient, I have prophesied that within this retinue, the bodhisattva great being Maitreya will fully awaken to unsurpassed and perfect buddhahood.

source: དུས་འདི་ནས་ལོ་བཅུ་གཉིས་ཀྱི་འོག་ཏུ་ཚེའི་དུས་བྱས་ནས། ངེས་པར་དགའ་ལྡན་གྱི་གནམ་དུ་སྐྱེ་བ་ལེན་པར་འགྱུར་རོ། །དེ་ནས་དགའ་ལྡན་གྱི་གནམ་གྱི་སྟེང་ན།
en: Twelve years from now, he will pass away and undoubtedly take birth in the Heaven of Joy.

source: ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་ལྔ་བརྒྱ་ཡོད་པ། ལྷའི་བུ་རེ་རེས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་སྤྱོད་པས།
en: “In the Heaven of Joy, there are five hundred quintillion gods, each of whom practices the profound perfection of generosity.

source: སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་དོན་དུ། ལྷའི་བསོད་ནམས་ཀྱི་མཐུས། གཞལ་མེད་ཁང་བྱས་ཏེ།
en: Thus, the gods have used the power of their divine merit to construct celestial palaces to worship this bodhisattva who has only one birth remaining.

source: རང་རང་གི་ལུས་ཀྱི་གོས་དང་། ཙན་དན་དང་། རིན་པོ་ཆེའི་དབུ་རྒྱན་ཕུད་དེ།
en: To do so, they first removed their robes, sandalwood jewelry, and precious crowns.

source: པུས་མོ་བཙུགས་ནས་ཐལ་མོ་སྦྱར་ཏེ། སྨོན་ལམ་འདི་སྐད་ཅེས་བཏབ་བོ།
en: They knelt, joined their palms together, and prayed:

source: །བདག་གི་རིན་ཐང་མེད་པའི་རིན་པོ་ཆེ་དང་། ལྷའི་དབུ་རྒྱན་གྱིས།
en: ‘With our priceless jewels and divine crowns, we wish to worship the great bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལ་མཆོད་པའི་དོན་དུ། མ་ཕམ་པ་འདི་མ་འོངས་པའི་དུས་སུ་རིང་པོ་མི་ཐོགས་པར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོས་ནས། བདག་ཅག་གི་རིན་པོ་ཆེའི་དབུ་རྒྱན་འདི། །སངས་རྒྱས་ཀྱི་ཞིང་ཁམས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་མཆོད་པའི་རྫས་སུ་གྱུར་ཅིག་ཅེས་ལྷའི་བུ་ཐམས་ཅད་རང་རང་པུས་མོ་བཙུགས་ཏེ།
en: We have heard the prophecy that Ajita will awaken to unsurpassed and perfect buddhahood not long in the future, so may our precious crowns transform into substances for the worship of his fully adorned buddha-realm!’ Each god knelt and made this prayer.

source: སྨོན་ལམ་དེ་སྐད་ཅེས་བཏབ་པ་དང་། དེ་ནས་ལྷ་ཐམས་ཅད་ཀྱིས་སྨོན་ལམ་བཏབ་མ་ཐག་ཏུ། རིན་པོ་ཆེའི་དབུ་རྒྱན་ཐམས་ཅད་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་ལྔ་བརྒྱའི་གཞལ་མེད་ཁང་དུ་གྱུར་ཏེ།
en: “As soon as all the gods had made this prayer, all their jeweled crowns transformed into five hundred quintillion palaces.

source: རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་རེ་རེ་ལ་ཡང་སྐྱེད་མོས་ཚལ་བདུན་བདུན། སྐྱེད་མོས་ཚལ་རེ་རེ་ཡང་། རིན་པོ་ཆེ་སྣ་བདུན་བདུན་ལས་གྲུབ་པ།
en: Each precious palace contained seven parks, each of which was made of seven precious substances.

source: རིན་པོ་ཆེ་རེ་རེ་ལས་ཀྱང་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་འོད་ཀྱི་འོད་ཟེར་རེ་རེ་ལས་བྱེ་བ་ཕྲག་བརྒྱའི་པད་མ་པད་མ་རེ་རེ་ལས་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་གི་ཕྲེང་བ།
en: Each precious substance emitted five billion rays of light, from each of which came five billion lotuses. From each lotus emerged five billion rows of trees made of the seven precious substances.

source: ཤིང་རེ་རེའི་ལོ་མ་ལས་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེའི་ཁ་དོག །རིན་པོ་ཆེའི་ཁ་དོག་རེ་རེ་ལས་ཀྱང་།
en: The leaves of each tree held five billion light rays in dazzling colors, and each of these dazzling colors emitted a further five billion light rays the color of Jambū river gold.

source: བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་འཛམ་བུའི་གསེར་གྱི་འོད་འཛམ་བུའི་གསེར་གྱི་འོད་རེ་རེའི་ནང་ནས་ཀྱང་། བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེའི་ལྷའི་བུ་མོ།
en: From each of these Jambū-gold light rays emerged five billion precious goddesses.

source: ལྷའི་བུ་མོ་རེ་རེ་ཡང་ཤིང་གི་དྲུང་ན་འདུག་ནས། ལག་ན་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེ་གྲངས་མེད་པའི་དོ་ཤལ་ཐོགས། ངོ་མཚར་ཆེ་བའི་གླུ་དབྱངས་སྙན་པ་ལེན། གླུ་དབྱངས་སྙན་པའི་ནང་ནས་ཕྱིར་མི་ལྡོག་པའི་སའི་ཆོས་ཀྱི་འཁོར་ལོ་སྤྱོད།
en: Each goddess sat beneath the trees, holding in her hands five billion garlands with countless gems, and singing the loveliest songs about the Dharma wheel of the nonregressing level.

source: ཤིང་དེ་དག་ལས་འབྲས་བུ་སྐྱེས་པའི་ཁ་དོག་བཻ་དཱུརྱ་བཞིན་དུ་འདུག །ཁ་དོག་དེ་དག་ཐམས་ཅད་བཻ་དཱུརྱའི་ནང་དུ་འདུག་པ།
en: “Fruit grew in the trees, with a color like beryl, and all these colors were reflected in the beryl.

source: འོད་ཟེར་དེ་དག་ཐམས་ཅད་གཡས་ཕྱོགས་སུ་འཁོར་བ། སྒྲ་སྙན་པ་སྣ་ཚོགས་འབྱུང་བ། སྒྲ་ཐམས་ཅད་ལས། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཆོས་འཆད་པ།
en: As all the light rays swirled clockwise, many pleasant voices could be heard teaching the Dharma of great love and great compassion.

source: རེ་རེའི་ཕོ་བྲང་མཐོ་ཁྱད་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་གཉིས། རྔམས་སུ་དཔག་ཚད་བཅུ་བཞི།
en: Each palace was sixty-two leagues in height and fourteen leagues in width.

source: ཀླུའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་ལྔ་བརྒྱས་ནི་ཕོ་བྲང་བསྐོར། ཀླུའི་རྒྱལ་པོ་རེ་རེ་ཡང་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་གི་ཆར་ཕབ་པས་ཕོ་བྲང་གི་སྟེང་བརྒྱན།
en: Five billion nāga kings encircled each palace, beautifying it from above by causing rain to fall over the five billion trees made of the seven precious substances.

source: རང་བཞིན་རླུང་བྱུང་བས་ཤིང་དེ་དག་བསྐྱོད་པ་དང་། ཤིང་དེ་ལས་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་སྒྲ་བྱུང་བར་གྱུར་ཏོ།
en: Natural breezes caused the trees to sway to and fro, so that they resounded with the words of impermanence, suffering, emptiness, selflessness, and all the perfections.

source: །དེ་ནས་ཕོ་བྲང་དེའི་ནང་ན། རྒྱལ་པོ་ཆེན་པོ་ལེའུ་དུ་པ་ཏི་ཞེས་བྱ་བ། སྟན་ལ་འདུག་པ་ལས་ལངས་ཏེ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ནས། སྨོན་ལམ་འདི་སྐད་ཅེས་བཏབ་བོ། །བདག་གི་བསོད་ནམས་ཀྱིས།
en: “At that time, inside his palace, the great king Laodubati rose from his seat, prostrated to all the thus-gone ones in the ten directions, and made the following prayer:

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་ཆོས་ཀྱི་ཕོ་བྲང་བྱེད་པའི་བསོད་ནམས་དང་ལྡན་ན།
en: ‘If I possess the merit to construct a Dharma palace for the bodhisattva Maitreya, may precious gems spontaneously appear from between my eyebrows!’

source: བདག་གི་སྨིན་མཚམས་བར་ནས་ནོར་བུ་རིན་པོ་ཆེ་རང་བྱུང་བར་གྱུར་ཅིག །ཅེས་སྨོན་ལམ་བཏབ་པ་དང་། དེ་མ་ཐག་ཏུ་བྱེ་བ་ཕྲག་བརྒྱའི་རིན་པོ་ཆེ་བྱུང་ནས།
en: “As soon as he made this prayer, one billion jewels appeared.

source: རིན་པོ་ཆེ་བཻ་དཱུརྱ་ལ་སོགས་པའི་ཁ་དོག་ཐམས་ཅད་རྫོགས་པར་གྲུབ་པ། ཤེལ་གྱི་ཁ་དོག་བཞིན་ཕྱི་ནང་གསལ་བ། རིན་པོ་ཆེ་དེ་དག་ནམ་མཁའ་སྟོང་པ་ལ་འཁོར་ཞིང་། ངོ་མཚར་ཆེ་བའི་རིན་པོ་ཆེའི་ཕོ་བྲང་རིམ་པ་བཞི་བཅུ་རྩ་དགུ་སྤྲུལ་པར་གྱུར་ཏོ། །རེ་རེའི་ལན་ཞུན་རེ་རེ་ལས་ཀྱང་།
en: They had formed in all different colors, like beryl and other gems, and were transparent like crystal. The jewels first circled the empty sky and then transformed into an amazing jeweled palace with forty-nine stories.

source: བྱེ་བ་འབུམ་ཕྲག་གི་རིན་པོ་ཆེ་པད་མ་འདིས་སྤྲས་པ་ལ་གྲུབ་པ།
en: “Each railing of each story was adorned by one trillion jeweled lotuses.

source: ལན་ཞུན་གྱི་བར་ཐམས་ཅད་ན། རྫུ་ས་ཏེ་སྐྱེས་པའི་ལྷའི་བུ་བྱེ་བ་ཕྲག་དགུ་དང་། ལྷའི་བུ་མོ་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་ལ།
en: Ninety million gods and five billion goddesses, born miraculously, stood among these railings.

source: ལྷའི་བུ་རེ་རེའི་ལག་ནས་རིན་པོ་ཆེ་སྣ་བདུན་བདུན་ལས་གྲུབ་པའི་པད་མ་དཔག་ཏུ་མེད་པ་བྱེ་བ་ཕྲག་བཅུ།
en: In the hands of each god were immeasurably many hundreds of millions of lotuses, each made of the seven precious substances.

source: པད་མ་རེ་རེའི་སྟེང་དུ་འོད་བྱེ་བ་ཕྲག་དཔག་ཏུ་མེད་པ་འོད་དེ་དག་གི་ནང་ན།
en: Above each lotus shone immeasurably many millions of lights.

source: ལྷའི་རོལ་མོའི་ཆ་སྤྱད་མ་དཀྲོལ་བར་སྒྲ་རང་བྱུང་བ། སྒྲ་དེ་དག་བྱུང་བ་དང་། བུ་མོ་ཐམས་ཅད་ལངས་ནས།
en: Inside these lights were divine musical instruments that spontaneously resounded without being played.

source: རོལ་མོའི་ཆ་སྤྱད་ཐོགས་ཏེ། གར་དང་། གླུ་དབྱངས་སྙན་པ་ལེན་པའི་སྒྲ་ལས། དགེ་བ་བཅུ་དང་། སྨོན་ལམ་བཞི་ལ་སོགས་པའི་སྒྲ།
en: As the music played, the goddesses rose, took hold of the musical instruments, danced, and sang lovely songs about the ten virtues, the four aspirations, and so on.

source: ལྷ་ཐམས་ཅད་ཀྱིས་ཐོས་པས། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་ནས་སྐྱེད་མོས་ཚལ་ཐམས་ཅད་ཀྱི་ནང་ན།
en: All the gods who heard this generated the mind set upon unsurpassed awakening.

source: སྐྱེད་མོས་ཚལ་ཁ་དོག་བརྒྱད་ཀྱི་བཻ་དཱུརྱའི་རྫིང་བུ་རྫིང་བུ་རེ་རེའི་ནང་ན།
en: “Inside each park were reservoirs of beryl in eight hues.

source: བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེ་ལས་གྲུབ་པ། རྫིང་བུ་རེ་རེའི་ནང་ན། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ། ཆུ་དེ་དག་ཀྱང་གྱེན་དུ་འབབ་པ། སྒོ་བཞིའི་ཕྱི་རོལ་ན་རྫུས་ཏེ་སྐྱེས་པའི་པད་མ་བཞི།
en: The interior of each reservoir was made of five billion jewels and filled with water possessing the eight qualities that spouted up from below. Outside the four entrances were four miraculously arisen lotuses.

source: པད་མ་དེ་དག་ལས་ཆུ་བྱུང་བ་རིན་པོ་ཆེའི་པད་མའི་ཁ་དོག་བཞིན་དུ་འབབ་པ།
en: The water that emerged around these lotuses flowed with the color of the precious blossoms.

source: པད་མ་རེ་རེའི་སྟེང་དུ་ལྷའི་བུ་མོ་ཉི་ཤུ་རྩ་བཞི་བཞི། ལུས་ཀྱི་ཁ་དོག་ངོ་མཚར་ཆེ་བ། བྱང་ཆུབ་སེམས་དཔའ་བཞིན་དུ་བརྒྱན་པ། ལུས་མཚན་དང་ལྡན་པ།
en: Atop each lotus were twenty-four goddesses of wondrous beauty, adorned and bearing physical marks like bodhisattvas.

source: ལག་ན་རིན་པོ་ཆེའི་རང་བཞིན་གྱི་སྣོད་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་སྤྲུལ།
en: Five billion jeweled vessels appeared in their hands.

source: སྣོད་རེ་རེའི་ནང་ན། ལྷའི་བདུད་རྩིའི་རང་བཞིན་ཐམས་ཅད་ཀྱིས་གང་བ།
en: Each vessel was filled to the brim with divine ambrosia.

source: ཕྲག་པ་གཡོན་ལ་ཐོགས་པ། དོ་ཤལ་དཔག་ཏུ་མེད་པ། ཕྲག་པ་གཡས་ལ་ཐོགས་པ།
en: Draped over their left shoulders were countless garlands, and balanced against their right shoulders were countless musical instruments.

source: རོལ་མོའི་ཆ་བྱད་དཔག་ཏུ་མེད་པ་སྤྲིན་བཞིན་དུ་ནམ་མཁའ་ལ་འདུག་པ། ཆུ་ལས་བྱུང་བ།
en: Like clouds, they hovered in the sky and came forth from the water.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བརྗོད་པ།
en: The goddesses extolled the six perfections of the bodhisattvas.

source: དགའ་ལྡན་གྱི་གནམ་དུ་སྐྱེས་པའི་ལྷའི་བུ་གང་ལ་ལ་ཞིག །རང་བཞིན་གྱིས་ལྷའི་བུ་མོ་རྣམས་ཀྱིས་གཡོག་བྱས་པ།
en: Any god born in the Heaven of Joy was naturally served by these goddesses.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སེང་གེའི་ཁྲི་འཕང་དུ་དཔག་ཚད་བཞི་ཡོད་པ།
en: “In the palace stood a lion throne made of the seven precious substances.

source: འཛམ་བུའི་གསེར་དང་། རིན་པོ་ཆེ་དཔག་ཏུ་མེད་པས་བརྒྱན་པ་ཟུར་བཞི་ལ་འདུག་པ།
en: It was four leagues in height and adorned with gold from the Jambū river and countless jewels.

source: པད་མ་བཞི་ལས་སྐྱེས་པ། པད་མ་རེ་རེ་ལ་ཡང་རིན་པོ་ཆེ་ཕྲག་བརྒྱ་ལས་གྲུབ་པ། རིན་པོ་ཆེ་རེ་རེ་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱའི་འོད་ཟེར།
en: At the four corners of the throne were four lotuses, each made of a hundred precious jewels, each of which emitted a billion rays of light.

source: འོད་ཟེར་དེ་དག་ལས། ངོ་མཚར་ཆེ་བ་སྤྲུལ་པའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་སྤྲུལ་པས་བརྒྱན་པ།
en: The light produced the most beautiful flowers, which were made of a variety of gems, which in turn adorned the precious draperies.

source: རིན་པོ་ཆེའི་ཡོལ་བ་བྲེས་པ་དེའི་ཕྱོགས་ན་ཚངས་པའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་སྟོང་གིས། རང་རང་གི་ཚངས་པའི་ལྷའི་ངོ་མཚར་ཆེ་བའི་དྲིལ་བུ་ཁྱེར་ནས། ཡོལ་བའི་སྟེང་དུ་སྤྱངས་པ།
en: “Ten billion Brahmā kings each brought their own beautiful chimes from the Brahmā heavens and hung them over the draperies.

source: ཚངས་པའི་རྒྱལ་པོ་ཆུང་ངུས་ཀྱང་། རིན་པོ་ཆེ་སྣ་ཚོགས་པའི་དྲ་བས་ཡོལ་བའི་སྟེང་དུ་བྲེས་པ།
en: Lesser Brahmā kings likewise draped nets of various jewels over the draperies.

source: དེ་ནས་ལྷའི་བུ་དང་། ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གྲངས་མེད་པའི་འཁོར་གྱིས། རིན་པོ་ཆེའི་མེ་ཏོག་པད་མ་ཐམས་ཅད་ཁྱེར་ནས་ཁྲིའི་སྟེང་དུ་བདལ་བ།
en: A retinue of countless hundreds of thousands of gods and goddesses brought forth a great variety of jeweled lotus flowers and scattered them over the throne.

source: པད་མ་དེ་དག་ཐམས་ཅད་རིན་པོ་ཆེའི་རང་བཞིན་གྱི་བུ་མོ་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་བྱུང་བ་དེ་དག་གི་ལག་ན་རྔ་ཡབ་དཀར་པོ་ཐོགས་པ། ཡོལ་བའི་ནང་ན་འདུག་པ།
en: These lotuses in turn produced five billion goddesses, made of gems, who stood among the draperies with white tail whisks in their hands.

source: ཕོ་བྲང་ཟུར་བཞི་ལ་རིན་པོ་ཆེའི་ཀ་བ་བཞི་ཡོད་པ།
en: “At the four corners of the palace were four jeweled pillars.

source: རིན་པོ་ཆེའི་ཀ་བ་རེ་རེ་ལ་ཡང་བརྒྱ་ཕྲག་སྟོང་གི་ཁང་པ་བརྩེགས་པ། བུ་མོ་འདིའི་ནོར་བུ་ནི་བྲེས། ལན་ཀན་བར་ཀུན་ཏུ་ལྷའི་བུ་མོ་བརྒྱ་སྟོང་ཡོད། ཁ་དོག་ངོ་མཚར་ཆེ་བ། དཔག་ཏུ་མེད་པའི་རོལ་མོའི་ཆ་སྤྱད་ལག་ན་ཐོགས་པ།
en: Each jeweled pillar consisted of a hundred thousand mansions, and the gems of these goddesses were draped between them. On the railings of the palace stood a hundred thousand goddesses of amazing beauty, holding countless musical instruments in their hands.

source: རོལ་མོའི་སྒྲའི་ནང་ནས་སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། མི་རྟག་པ་དང་། བདག་མེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་སྒྲ་འབྱུང་བ།
en: Their music resounded with the words of suffering, emptiness, impermanence, selflessness, and all the perfections.

source: ལྷའི་ཕོ་བྲང་དེ་དག་ནས་རིན་པོ་ཆེའི་ཁ་དོག་དཔག་ཏུ་མེད་པ་བྱེ་བ་ཕྲག་བརྒྱ་ཡོད་པ། བུ་མོ་རེ་རེ་ཀུན་ཀྱང་རིན་པོ་ཆེའི་ཁ་དོག་དང་འཐུན་པར་སྤྲུལ་ཏོ།
en: The divine palace was filled with immeasurably many billions of beautiful gems, and all the goddesses manifested in colors that matched those gems.

source: །དེ་ནས་ཕྱོགས་བཅུའི་ལྷ་དཔག་ཏུ་མེད་པ་ཐམས་ཅད། དགའ་ལྡན་གྱི་ལྷའི་ཕོ་བྲང་དུ་སྐྱེ་བ་ལེན་པར་སྨོན་ལམ་བཏབ་བོ།
en: Thereupon, all the countless gods throughout the ten directions made prayers for rebirth in this divine palace in the Heaven of Joy.

source: །དེ་ནས་དགའ་ལྡན་གྱི་ཕོ་བྲང་ན། རྒྱལ་པོ་ཆེན་པོ་ལྔ་པོ་ལ།
en: “Now, in that palace in the Heaven of Joy there are five great kings.

source: རྒྱལ་པོ་ཆེན་པོ་དང་པོ་ནི། རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཞེས་བྱ་བ།
en: The first great king is known as Ratnadhvaja.

source: ལུས་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཆར་འབེབས་པས་ཕོ་བྲང་གི་ནང་དུ་འཐོར་བ།
en: A rain of the seven precious substances is released from his body and scatters inside the palace.

source: རིན་པོ་ཆེའི་ནོར་བུ་རེ་རེ་ཡང་། རོལ་མོའི་ཆ་སྤྱད་དཔག་ཏུ་མེད་པར་སྤྲུལ་པ། ནམ་མཁའ་ལ་ཀུན་ཏུ་འཕྱང་བ།
en: Each precious substance then transforms into countless musical instruments that hang in midair.

source: མ་བརྡུངས་པར་སྒྲ་སྙན་པ་དཔག་ཏུ་མེད་པ་རང་འབྱུང་བ། སེམས་ཅན་གྱི་ཡིད་རྟོག་པ།
en: Without being played, they spontaneously emit limitless beautiful music that pleases the minds of beings.

source: རྒྱལ་པོ་གཉིས་པ་མེ་ཏོག་འཐོར་བ་ཞེས་བྱ་བ། ལུས་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་པ། ཕོ་བྲང་ཐམས་ཅད་ཁྱབ་པར་མེ་ཏོག་གི་གདུགས་སྤྲུལ། གདུགས་རེ་རེ་ཡང་བརྒྱ་ཕྲག་སྟོང་གི་རྒྱལ་མཚན་དང་། འཕན་གྱིས་ལམ་དྲངས་པ།
en: The second king is known as Flower Scatterer. A rain of manifold flowers is released from his body, forming parasols of flowers that cover the entire palace. Each parasol has hundreds of thousands of flags and streamers that guide one along the way.

source: རྒྱལ་པོ་གསུམ་པ་ནི། སྤོས་ཀྱི་དབྱངས་ཞེས་བྱ་བ།
en: The third king is known as Incense Voice.

source: ལུས་ཀྱི་བ་སྤུའི་ཁུང་བུའི་ནང་ནས། ངོ་མཚར་ཆེ་བའི་རྒྱ་མཚོའི་འགྲམ་གྱི་ཙན་དན་གྱི་སྤོས་ཀྱི་ཆར་འབེབས་པ།
en: From the pores of his body, he rains down a wondrous incense of the sandalwood found at the ocean shore.

source: སྤོས་དེ་དག་སྤྲིན་བཞིན་དུ་ཆགས་པ། ཁ་དོག་བརྒྱ་ཕྲག་གིས་ཕོ་བྲང་ལན་བདུན་དུ་བསྐོར་བ།
en: The incense forms a cloud with hundreds of colors, which circles the palace seven times.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པ། དགའ་བ་བདེ་བ་ཞེས་བྱ་བ།
en: The fourth great king is known as Joyous Bliss.

source: ལུས་ལ་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེའི་ཆར་འབེབས་པ།
en: A rain of wish-fulfilling jewels is released from his body.

source: རིན་པོ་ཆེ་རེ་རེ་ཡང་རང་བཞིན་གྱིས་རྒྱལ་མཚན་དང་། འཕན་གྱི་སྟེང་དུ་འདུག་ནས་སངས་རྒྱས་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་། ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་འགྲོ་བར་འཆད་པ་དང་། ཡན་ལག་ལྔའི་ཚུལ་ཁྲིམས་ཀྱི་སྒྲ་དང་། དགེ་བའི་ཆོས་དཔག་ཏུ་མེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། བྱམས་པ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒྲ་ལ་འཛུད་པ། རྒྱལ་པོ་ཆེན་པོ་ལྔ་པ། སྒྲ་དབྱངས་དྲག་པོ་ཞེས་བྱ་བ། ལུས་ཀྱི་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཆུ་འབེབས་པ།
en: Each jewel naturally finds its place atop the flags and streamers, where it resounds with teachings on seeking refuge in the Buddha, Dharma, and Saṅgha, as well as the five branches of discipline, countless virtuous qualities, all the perfections, and the aids to Maitreya’s awakening. The fifth great king is known as Fierce Voice. He rains down water from all the pores of his body.

source: ཆུ་རེ་རེའི་སྟེང་དུ་མེ་ཏོག་པད་མ་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་ཡོད་པ། པད་མ་རེ་རེའི་སྟེང་དུ་ཤེལ་གྱི་བུ་མོ་ཉི་ཤུ་རྩ་ལྔ་ལྔ། ཤེལ་གྱི་བུ་མོ་རེ་རེའི་ལུས་ཐམས་ཅད་ཀྱི་བ་སྤུའི་བུ་ག་རེ་རེའི་ནང་ནས། ལྷའི་བདུད་ལས་རྒྱལ་བའི་སྒྲ་སྙན་པ་འབྱུང་བ་སྤྲུལ་ལོ།
en: Five billion lotus flowers float on each water drop, and each lotus supports twenty-five crystal goddesses. Ringing out from every pore on the body of each crystal goddess is the lovely sound of victory over the divine māra.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཨུ་པཱ་ལི་ལ་བཀའ་སྩལ་པ། དགའ་ལྡན་གྱི་ལྷའི་གནས་ཞེས་བྱ་བར། དགེ་བ་བཅུ་དང་། རྒྱལ་བ་ལ་དྲིན་བསབ་པ་དང་། ངོ་མཚར་ཆེ་བ་བསྐྱེད་པའི་བསོད་ནམས་ནི། ངས་བསྐལ་པ་ཆུང་ངུ་གཅིག་གི་བར་དུ་འདུག་ནས། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དྲིན་བསབ་པ་དང་། དགེ་བ་བཅུའི་འབྲས་བུ་བཤད་ཀྱང་རྫོགས་པའི་མཐའ་མེད་དེ།
en: The Blessed One continued addressing Upāli, “In the Heaven of Joy, beings practice the ten virtues, return the kindness of the victorious ones, and have the merit to produce great wonders. Even if I were to spend an entire lesser eon explaining the fruits of how a bodhisattva bound by one life will return kindness and practice the ten virtues, it would not be exhaustive.

source: འདིར་ངས་ཁྱེད་ལ་སོགས་པ་ལ་མདོ་ཙམ་ཞིག་བཤད་ཅིང་བསྟན་པར་བྱའོ། །ཨུ་པཱ་ལི་དགེ་སློང་ངམ།
en: Nevertheless, I will now briefly teach you and the others about this.

source: འཁོར་ཐམས་ཅད་ཀྱང་རུང་སྟེ། གང་ལ་ལ་ཞིག་སྐྱེ་ཤི་ལ་མི་སྐྱོ་བར། ལྷའི་གནས་སུ་སྐྱེ་བར་འདོད་ན། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ།
en: “Upāli, whether it is a single monk or the entire retinue, anyone who has not yet grown weary of birth and death, and wishes to be reborn in a divine realm, must generate the mind set upon unsurpassed awakening.
